[HighQualityRounds X2AmmoTemplate]
FriendlyName="High Quality Rounds"
FriendlyNamePlural="High Quality Rounds"
BriefSummary="These High Quality Rounds have been custom made by XCOM to fit their purposes."
TacticalText="<Bullet/> These High Quality Rounds have been custom made by XCOM to fit their purposes.<br>"

[HighQualityRounds.X2AbilityTemplate]
[HighQualityRoundsBonusAbility X2AbilityTemplate]
LocFriendlyName="Hi-Quality Rounds"
LocHelpText="+5 Aim"

[PushUpKineticVest X2EquipmentTemplate]
FriendlyName="Kinetic Vest"
FriendlyNamePlural="Kinetic Vests"
BriefSummary="By reinforcing with Elerium Core and Alien Alloy materials, the Kinetic Vest is able to absorb Kinetic Energy, which provides an rechargeable Energy shields, also gaining soldier abilities to manipulate the absorbed Kinetic Energy to provides protection to allies and dealing impacts to emeries."
TacticalText="<Bullet/> Provide Maximum <Ability:MaxShieldAmount/> rechargeable Energy shields.\n<Bullet/> Solider need to do push up to generate Kinetic Energy to recharge Energy shields."

[PushUpKineticVestLite X2EquipmentTemplate]
FriendlyName="Kinesis Vest"
FriendlyNamePlural="Kinesis Vests"
BriefSummary="By reinforcing Nanoscale Vest with Alien Alloy materials, the Kinesis Vest is able to absorb Kinetic Energy, which provides an rechargeable Energy shields, also gaining soldier abilities to manipulate the absorbed Kinetic Energy to control the emeries."
TacticalText="<Bullet/> Provide Maximum <Ability:MaxShieldAmount/> rechargeable Energy shields.\n<Bullet/> Solider need to do push up to generate Kinetic Energy to recharge Energy shields."

[PushUpKineticVestMate X2EquipmentTemplate]
FriendlyName="Kinetic Shield Vest"
FriendlyNamePlural="Kinetic Shield Vests"
BriefSummary="By reinforcing Nanoscale Vest with Alien Alloy materials, the Kinetic Shield Vest is able to absorb Kinetic Energy, which provides an rechargeable Energy shields, also gaining soldier abilities to manipulate the absorbed Kinetic Energy to provide protection to allies."
TacticalText="<Bullet/> Provide Maximum <Ability:MaxShieldAmount/> rechargeable Energy shields.\n<Bullet/> Solider need to do push up to generate Kinetic Energy to recharge Energy shields."

[PushUpKineticVestPro X2EquipmentTemplate]
FriendlyName="Kinetic Explosion Vest"
FriendlyNamePlural="Kinestic Explosion Vests"
BriefSummary="By reinforcing Nanoscale Vest with Alien Alloy materials, the Kinetic Explosion Vest is able to absorb Kinetic Energy, which provides an rechargeable Energy shields, also gaining soldier abilities to manipulate the absorbed Kinetic Energy to dealing damages to the emeries."
TacticalText="<Bullet/> Provide Maximum <Ability:MaxShieldAmount/> rechargeable Energy shields.\n<Bullet/> Solider need to do push up to generate Kinetic Energy to recharge Energy shields."

[FragGrenade X2GrenadeTemplate]
FriendlyName="HE Grenade"
FriendlyNamePlural="HE Grenades"
BriefSummary="A high explosive grenade that deals extra damage to environments and shreds armor."
TacticalText="<Bullet/> HE grenades are useful for removing, or \"shredding\" enemy armor.<br><Bullet/> They do only little damage, but do devastating damage to the environment.<br><Bullet/> Grenades can destroy targets' equipment, so relying on grenades too much will reduce our salvage opportunities."
ThrownAbilityName="Throw HE Grenade"
ThrownAbilityHelpText="Throw a HE grenade at target area. Shreds armor, destroys cover."
LaunchedAbilityname="Launch HE Grenade"
LaunchedAbilityHelpText="Launch a HE grenade at target area. Shreds armor, destroys cover."

[FlechetteGrenade X2GrenadeTemplate]
FriendlyName="Flechette Grenade"
FriendlyNamePlural="Flechette Grenades"
BriefSummary="A shrapnel grenade that deals high damage to enemies, piercing their armor. Deals almost no damage to environment."
TacticalText="<Bullet/> Flechette grenades can deal a lot of damage to multiple enemies.<br><Bullet/> Flechette grenades pierce enemy armor through weak points, but do not shred it.<br><Bullet/> Grenades can destroy targets' equipment, so relying on grenades too much will reduce our salvage opportunities."
ThrownAbilityName="Throw Flechette Grenade"
ThrownAbilityHelpText="Throw a flechette grenade at target area. Pierces armor, no cover damage."
LaunchedAbilityname="Launch Flechette Grenade"
LaunchedAbilityHelpText="Launch a flechette grenade at target area. Pierces armor, no cover damage."


[BRSR_STRIKERIFLE_Conventional X2WeaponTemplate]
FriendlyName="Strike Rifle"
FriendlyNamePlural="Strike Rifles"
BriefSummary="The Strike Rifle is a more flexible alternative to the Sniper Rifle with a slightly bigger magazine. It is more accurate up close, but less accurate from afar. While it deals less damage than a Sniper Rifle, the Strike Rifle's light weight and low recoil grant it the No Scope ability, allowing the shooter to fire a standard shot that can't use squadsight or get critical hits for one non-turn-ending action once per turn. Can equip underbarrel weapons and standard bayonets."
TacticalText="<Bullet/> Requires two actions to fire or Overwatch. \n<Bullet/>Takes less time to infiltrate with than a standard sniper rifle."
AbilityDescName="strike rifle"

[BRSR_STRIKERIFLE_Laser X2WeaponTemplate]
FriendlyName="Laser Strike Lance"
FriendlyNamePlural="Laser Strike Lances"
BriefSummary="Based on the advances in laser weapons tech we've achieved, the Laser Strike Lance boasts a substantial improvement in power over our conventional strike rifle. Includes the No Scope ability. Can equip underbarrel weapons and standard bayonets."
TacticalText="<Bullet/> Laser weapons receive bonus aim. \n<Bullet/> Laser Strike Rifles are substantially more effective and accurate than their conventional precursors. \n<Bullet/> Requires two actions to fire or Overwatch. \n<Bullet/>Takes less time to infiltrate with than a standard sniper rifle."
AbilityDescName="strike rifle"

[BRSR_STRIKERIFLE_Magnetic X2WeaponTemplate]
FriendlyName="Mag Strike Rifle"
FriendlyNamePlural="Mag Strike Rifles"
BriefSummary="Based on the advances in magnetic weapons tech we've achieved, the Mag Strike Rifle boasts a substantial improvement in power over our conventional strike rifle. Includes the No Scope ability. Can equip underbarrel weapons and standard bayonets."
TacticalText="<Bullet/> Mag Strike Rifles do more damage than their conventional or laser precursors.\n<Bullet/> Requires two actions to fire or Overwatch. \n<Bullet/>Takes less time to infiltrate with than a standard sniper rifle."
AbilityDescName="strike rifle"

[BRSR_STRIKERIFLE_Coil X2WeaponTemplate]
FriendlyName="Coil Strike Rifle"
FriendlyNamePlural="Coil Strike Rifles"
BriefSummary="A powerful, coil-tech strike rifle that outperforms the Mag Strike Rifle in power output. Can punch through enemy armor. Includes the No Scope ability. Can equip underbarrel weapons and standard bayonets."
TacticalText="<Bullet/> Coil weapons automatically pierce 1 enemy armor.\n<Bullet/> Requires two actions to fire or Overwatch. \n<Bullet/>Takes less time to infiltrate with than a standard sniper rifle."
AbilityDescName="strike rifle"

[BRSR_STRIKERIFLE_Beam X2WeaponTemplate]
FriendlyName="Plasma Strike Lance"
FriendlyNamePlural="Plasma Strike Lances"
BriefSummary="The ultimate strike rifle model, the Plasma Strike Lance integrates the aliens' plasma weapons technology to powerful effect. Includes the No Scope ability. Can equip underbarrel weapons, standard bayonets and powered bayonets."
TacticalText="<Bullet/> Plasma weapons cause targets to take 1 additional damage on future hits.\n<Bullet/> Plasma Strike Lances are the most powerful strike rifles on Earth.\n<Bullet/> Requires two actions to fire or Overwatch. \n<Bullet/>Takes less time to infiltrate with than a standard sniper rifle."
AbilityDescName="strike rifle"

[BRSR_BATTLERIFLE_Conventional X2WeaponTemplate]
FriendlyName="Battle Rifle"
FriendlyNamePlural="Battle Rifles"
BriefSummary="The Battle Rifle is an alternative to the Cannon that offers superior control due to its smaller profile. It is more accurate than a Cannon up close, but less so at range. While its damage and magazine size are both lower than the Cannon's, the Battle Rifle grants the Russian Roulette ability, which lets the user make another Overwatch shot if their previous attempt misses. Can equip underbarrel weapons and standard bayonets."
TacticalText="<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of specialized training. \n<Bullet/>Takes less time to infiltrate with than a standard cannon."
AbilityDescName="battle rifle"

[BRSR_BATTLERIFLE_Laser X2WeaponTemplate]
FriendlyName="Laser Pulser"
FriendlyNamePlural="Laser Pulsers"
BriefSummary="Based on the advances in laser weapons tech we've achieved, the Laser Pulser boasts a substantial improvement in power over our conventional battle rifle. Includes the Russian Roulette ability. Can equip underbarrel weapons and standard bayonets."
TacticalText="<Bullet/> Laser weapons receive bonus aim. \n<Bullet/> Laser Pulsers are substantially more effective and accurate than their conventional precursors. \n<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of specialized training. \n<Bullet/>Takes less time to infiltrate with than a standard cannon."
AbilityDescName="battle rifle"

[BRSR_BATTLERIFLE_Magnetic X2WeaponTemplate]
FriendlyName="Mag Battle Rifle"
FriendlyNamePlural="Mag Battle Rifles"
BriefSummary="Based on the advances in magnetic weapons tech we've achieved, the Mag Battle Rifle boasts a substantial improvement in power over our conventional strike rifle. Includes the Russian Roulette ability. Can equip underbarrel weapons and standard bayonets."
TacticalText="<Bullet/> Mag Battle Rifles do more damage than their conventional or laser precursors.\n<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of specialized training. \n<Bullet/>Takes less time to infiltrate with than a standard cannon."
AbilityDescName="battle rifle"

[BRSR_BATTLERIFLE_Coil X2WeaponTemplate]
FriendlyName="Coil Battle Rifle"
FriendlyNamePlural="Coil Battle Rifles"
BriefSummary="A powerful, coil-tech battle rifle that outperforms the Mag Battle Rifle in power output. Can punch through enemy armor. Includes the Russian Roulette ability. Can equip underbarrel weapons and standard bayonets."
TacticalText="<Bullet/> Coil weapons automatically pierce 1 enemy armor.\n<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of specialized training. \n<Bullet/>Takes less time to infiltrate with than a standard cannon."
AbilityDescName="battle rifle"

[BRSR_BATTLERIFLE_Beam X2WeaponTemplate]
FriendlyName="Plasma Cycler"
FriendlyNamePlural="Plasma Cyclers"
BriefSummary="The ultimate battle rifle model, the Plasma Cycler integrates the aliens' plasma weapons technology to powerful effect. Includes the Russian Roulette ability. Can equip underbarrel weapons, standard bayonets and powered bayonets."
TacticalText="<Bullet/> Plasma weapons cause targets to take 1 additional damage on future hits.\n<Bullet/> Plasma Cyclers are the most powerful battle rifles on Earth.\n<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of specialized training. \n<Bullet/>Takes less time to infiltrate with than a standard cannon."
AbilityDescName="battle rifle"

[BRSR_RussianRoulette X2AbilityTemplate]
LocFriendlyName="Russian Roulette"
LocLongDescription="When on Overwatch, if your shot misses, another shot will be taken as long as ammo is available. Only affects the primary weapon, not secondaries or pistols."
LocHelpText="When on Overwatch, if your shot misses, another shot will be taken as long as ammo is available."
LocFlyOverText="Russian Roulette"
LocPromotionPopupText="<Bullet/> Shots will continue to be taken until a hit is made, ammo runs out or there are no more targets to shoot at.\n<Bullet/> Critical hits and grazes both are considered \"hits\" for the purposes of this ability.\n<Bullet/> Only affects regular Overwatch; Return Fire and similar abilities that grant other kinds of reaction shots are unaffected.\n<Bullet/> This soldier won't continue to make Overwatch shot attempts if their Overwatch is removed, e.g. by taking damage, being suppressed or becoming disoriented."

[BRSR_NoScope X2AbilityTemplate]
LocFriendlyName="No Scope"
LocLongDescription="Fire a standard shot for one action that doesn't end the turn, but can't use Squadsight or get critical hits. Can be used once per turn."
LocHelpText="Fire a standard shot for one action that doesn't end the turn, but can't use Squadsight or get critical hits."
LocFlyOverText="No Scope"
LocPromotionPopupText="<Bullet/> No Scope not ending the turn and only needing 1 action makes it combine well with many Sharpshooter abilities, such as Death From Above or Snap Shot, as well as with other weapons such as a pistol or a Holotargeter."

[SMGConvSingleFire X2AbilityTemplate]
LocFriendlyName="Single Fire"
LocLongDescription="Fire an accurate single shot; deals lower damage than standard burst fire."
LocHelpText="Fire an accurate single shot; deals lower damage than standard burst fire."

[SMGConvFullAuto X2AbilityTemplate]
LocFriendlyName="Full Auto"
LocLongDescription="Full Auto fire for higher damage, but with additional aim penalty."
LocHelpText="Full Auto fire for higher damage, but with additional aim penalty."

[SMGMagSingleFire X2AbilityTemplate]
LocFriendlyName="Single Fire"
LocLongDescription="Fire an accurate single shot; deals lower damage than standard burst fire."
LocHelpText="Fire an accurate single shot; deals lower damage than standard burst fire."

[SMGMagFullAuto X2AbilityTemplate]
LocFriendlyName="Full Auto"
LocLongDescription="Full Auto fire for higher damage, but with additional aim penalty."
LocHelpText="Full Auto fire for higher damage, but with additional aim penalty."

[SMGBeamSingleFire X2AbilityTemplate]
LocFriendlyName="Focused Beam"
LocLongDescription="Fire an accurate beam; deals lower damage than standard plasma fire."
LocHelpText="Fire an accurate beam; deals lower damage than standard plasma fire."

[SMGBeamFullAuto X2AbilityTemplate]
LocFriendlyName="Overcharged Beam"
LocLongDescription="Fire an amplified beam for higher damage, but with additional aim penalty."
LocHelpText="Fire an amplified beam for higher damage, but with additional aim penalty."

[SMGCoilSingleFire X2AbilityTemplate]
LocFriendlyName="Single Fire"
LocLongDescription="Fire an accurate single shot; deals lower damage than standard burst fire."
LocHelpText="Fire an accurate single shot; deals lower damage than standard burst fire."

[SMGCoilFullAuto X2AbilityTemplate]
LocFriendlyName="Full Auto"
LocLongDescription="Full Auto fire for higher damage, but with additional aim penalty."
LocHelpText="Full Auto fire for higher damage, but with additional aim penalty."

[SMGLaserSingleFire X2AbilityTemplate]
LocFriendlyName="Mode-Locking"
LocLongDescription="Fire an ultra-short, accurate laser pulse; deals lower damage than standard laser fire."
LocHelpText="Fire an ultra-short, accurate laser pulse; deals lower damage than standard laser fire."

[SMGLaserFullAuto X2AbilityTemplate]
LocFriendlyName="Q-Switching"
LocLongDescription="Fire a high-power laser pulse. Deals more damage, but has an additional aim penalty."
LocHelpText="Fire a high-power laser pulse. Deals more damage, but has an additional aim penalty."

[TLP_V_Rifle_CV X2WeaponTemplate]
FriendlyName="Old-world Assault Rifle"
FriendlyNamePlural="Old-world Assault Rifles"
BriefSummary="We've managed to salvage a variety of standard infantry small arms; this is the most common variety, similar to the rifle used twenty years before. While decidedly inferior to ADVENT magnetic technology, it can at least be upgraded using additional weapons salvage once we perfect modular weapon technology."
TacticalText="<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training."
AbilityDescName="Old-world Assault Rifle"

[TLP_V_2_AssaultRifle_MG X2WeaponTemplate]
FriendlyName="Improvised Laser Rifle"
FriendlyNamePlural="Improvised Laser Rifles"
BriefSummary="Laser projectile tech has enabled us to create rifle-style slugthrowers. They represent a substantial improvement in power relative to conventional assault rifles."
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn, in the absence of special training."
AbilityDescName="Improvised Laser Rifle"

[TLP_V_3_Rifle_BM X2WeaponTemplate]
FriendlyName="Prototype Plasma Rifle"
FriendlyNamePlural="Prototype Plasma Rifles"
BriefSummary="Now that we've finally deciphered the aliens' devastating weapon technology and can develop beam weapons of our own, we can build rifles that will be the match of any enemy our soldiers encounter in the field."
TacticalText="<Bullet/> The Plasma Rifle is a general purpose, supremely powerful primary infantry weapons system.\n<Bullet/> Firing the primary weapon always ends the soldier's turn."
AbilityDescName="Prototype Plasma Rifle"

[TLP_V_LMG_CV X2WeaponTemplate]
FriendlyName="Light Machine Gun"
FriendlyNamePlural="Light Machine Guns"
BriefSummary="The LMG is an improvised light support weapon, specialized for high volume fire. While decidedly inferior to ADVENT magnetic technology, it can at least be upgraded using additional weapons salvage once we perfect modular weapon technology."
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn."
AbilityDescName="Light Machine Gun"

[TLP_V_2_Cannon_MG X2WeaponTemplate]
FriendlyName="Laser Support Cannon"
FriendlyNamePlural="Laser Support Cannons"
BriefSummary="Laser weapons tech will let us deploy a rapid-fire version of the cannon. Our Grenadiers will be able to lay down a much deadlier volume of fire."
TacticalText="<Bullet/> The Laser Support Cannon is a much more powerful, yet equally deployable, version of the conventional LMG."
AbilityDescName="Magnetic Support Cannon"

[TLP_V_3_LMG_BM X2WeaponTemplate]
FriendlyName="Prototype Plasma Cannon"
FriendlyNamePlural="Prototype Plasma Cannons"
BriefSummary="Devising a more powerful, high-volume beam weapon for our Grenadiers required substantial effort, but the firepower it brings is unquestioned."
TacticalText="<Bullet/> The Prototype Plasma Cannon is the most powerful combat support weapon human forces can deploy."
AbilityDescName="Prototype Plasma Cannon"

[TLP_V_Pistol_CV X2WeaponTemplate]
FriendlyName="Traditional Handgun"
FriendlyNamePlural="Traditional Handguns"
BriefSummary="XCOM Sharpshooters carry high-caliber pistols in addition to their sniper rifles. With the proper training, Sharpshooters can pose an enormous threat at close range."
TacticalText="<Bullet/> Pistols can be much more than a sidearm in the hands of a trained Sharpshooter.\n<Bullet/> Unlike the sniper rifle, pistols can be fired with a single action.\n<Bullet/> Sharpshooters can train several abilities that dramatically enhance their use of pistols."
AbilityDescName="Traditional Handgun"

[TLP_V_2_Pistol_MG X2WeaponTemplate]
FriendlyName="Laser Pistol"
FriendlyNamePlural="Laser Pistols"
BriefSummary="Based on the advances in laser weapons tech we've achieved, this new pistol boasts a substantial improvement in power over our conventional pistol."
TacticalText="<Bullet/> Laser pistols are substantially more effective than their conventional precursors.\n<Bullet/> Unlike the Marksman's rifle, pistols can be fired with a single action."
AbilityDescName="Laser Pistol"

[TLP_V_3_Pistol_BM X2WeaponTemplate]
FriendlyName="Prototype Plasma Pistol"
FriendlyNamePlural="Prototype Plasma Pistols"
BriefSummary="The ultimate sidearm, this pistol integrates the aliens' beam weapons technology to powerful effect."
TacticalText="<Bullet/> Prototype Plasma pistols are the most powerful handguns on Earth.\n<Bullet/> Unlike the Marksman's rifle, pistols can be fired with a single action."
AbilityDescName="Prototype Plasma pistol"

[TLP_V_Shotgun_CV X2WeaponTemplate]
FriendlyName="Scattergun"
FriendlyNamePlural="Scatterguns"
BriefSummary="We've managed to salvage a variety of standard infantry small arms; this is a specialized weapon for close range engagement. While decidedly inferior to ADVENT magnetic technology, it can at least be upgraded using additional weapons salvage once we perfect modular weapon technology."
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn.\n<Bullet/> Shotguns are extremely effective at close range, but their accuracy drops off quickly at longer range."
AbilityDescName="Scattergun"

[TLP_V_2_Shotgun_MG X2WeaponTemplate]
FriendlyName="Laser Shotgun"
FriendlyNamePlural="Laser Shotguns"
BriefSummary="Laser weapons technology will let us synthesize alien alloy fragments into a spray-style projectile, and our Rangers can use it to dramatic effect: the closer the better."
TacticalText="<Bullet/> Magnetized weapon technology makes for an especially effective improvement of XCOM's combat shotgun.\n<Bullet/> Shotgun-style weapons are extremely effective at close range, but their accuracy drops off quickly at longer range."
AbilityDescName="Laser Shotgun"

[TLP_V_3_Shotgun_BM X2WeaponTemplate]
FriendlyName="Prototype Plasma Shotgun"
FriendlyNamePlural="Prototype Plasma Shotguns"
BriefSummary="The Prototype Plasma Shotgun fires a concentrated set of beam pulses, piercing and melting the target across a substantial surface area."
TacticalText="<Bullet/> This is the most advanced shotgun-style weapon available in the XCOM arsenal.\n<Bullet/> Shotgun-style weapons are extremely effective at close range, but their accuracy drops off quickly at longer range."
AbilityDescName="Prototype Plasma Shotgun"

[TLP_V_Sniper_CV X2WeaponTemplate]
FriendlyName="Marksman's Rifle"
FriendlyNamePlural="Marksman's Rifles"
BriefSummary="We've managed to salvage a variety of standard infantry small arms; this is a specialized weapon for medium to long range engagement. While decidedly inferior to ADVENT magnetic technology, it can at least be upgraded using additional weapons salvage once we perfect modular weapon technology."
TacticalText="<Bullet/> The sniper rifle always takes two actions to fire.\n<Bullet/> The sniper rifle suffers a penalty to hit at close range."
AbilityDescName="Marksman's Rifle"

[TLP_V_2_SniperRifle_MG X2WeaponTemplate]
FriendlyName="Laser Sniper Rifle"
FriendlyNamePlural="Laser Sniper Rifles"
BriefSummary="Laser weapons technology has particular utility for precision slow-fire weapons like sniper rifles. The Laser Rifle will enable our Sharpshooters to cause greater damage at extended range."
TacticalText="<Bullet/> Sniper rifles always require both actions to fire.\n<Bullet/> They are less accurate at close range, but deadly at a distance."
AbilityDescName="Laser Sniper Rifle"

[TLP_V_3_Sniper_BM X2WeaponTemplate]
FriendlyName="Prototype Plasma Sniper Rifle"
FriendlyNamePlural="Prototype Plasma Sniper Rifles"
BriefSummary="The aliens' focused beam technology has obvious applications for improving sniper rifles. The Plasma Lance is an unmatched sniper rifle."
TacticalText="<Bullet/> This is the apex of sniper rifle technology.\n<Bullet/> Sniper rifles always require both actions to fire.\n<Bullet/> They are less accurate at close range, but deadly at a distance."
AbilityDescName="Prototype Plasma Sniper Rifle"

[ShadowOps_CombatEngineer_LW2 X2SoldierClassTemplate]
DisplayName="Grenadier"
ClassSummary="Grenadier are experts at using grenades both offensively and defensively. If you want something blown up, torn down, or hidden in smoke, bring a Grenadier."

;Weapon Upgrades localization

[CritUpgrade_Prt X2WeaponUpgradeTemplate]
FriendlyName="Prototype Laser Sight"
FriendlyNamePlural="Prototype Laser Sights"
BriefSummary="Increase critical hit chance by +<Ability:CRITINCREASE/>%, improving more with proximity to target.\n<Bullet/> User may mark target."
TinySummary="Increased Crit Chance"
LootTooltip="This weapon upgrade will increase the critical hit chance of any weapon it is attached to."

[LaserSight_Prt X2AbilityTemplate]
LocFriendlyName="Prototype Laser Sight"
LocHelpText="Improves critical hit chance with proximity to target."

[LaserSight_BonusSkill X2AbilityTemplate]
LocFriendlyName="Laser Pointer"
LocLongDescription="Adds +<Ability:MARKTARGETAIMBONUS/> hit for any unit marked by this Laser Sight."
LocHelpText="Marked"
LocFlyOverText="Marked Target"

[AimUpgrade_Prt X2WeaponUpgradeTemplate]
FriendlyName="Prototype Scope"
FriendlyNamePlural="Prototype Scopes"
BriefSummary="<Bullet/>Provides the Covering Fire ability.\n<Bullet/>Shots can't graze.\n<Bullet/> User may fire a shot that will always crit."
TinySummary="Increased Aim"
LootTooltip="This weapon upgrade will add the Covering Fire ability to your weapon and prevent grazes."

[Scope_BonusSkill X2AbilityTemplate]
LocFriendlyName="Headshot"
LocLongDescription="The Soldier lines up a shot, focusing on vital organs or critical systems for increased damage."
LocHelpText="Takes a shot that is guaranteed to crit."
LocFlyOverText="Headshot"

[ClipSizeUpgrade_Prt X2WeaponUpgradeTemplate]
FriendlyName="Prototype Expanded Magazine"
FriendlyNamePlural="Prototype Expanded Magazines"
BriefSummary="Clip size is increased by <Ability:EXPMAGINCREASE/>.\n<Bullet/> User may fire a shot guaranteed to hit."
TinySummary="Increased Clip Size"
LootTooltip="This weapon upgrade will increase the ammunition count of any weapon it is attached to."

[FreeFireUpgrade_Prt X2WeaponUpgradeTemplate]
FriendlyName="Prototype Hair Trigger"
FriendlyNamePlural="Prototype Hair Triggers"
BriefSummary="Reaction Fire deals +<Ability:BONUSREACTIONFIREDAMAGESUP/> damage.\n<Bullet/> User may fire a rapid volley of shots./>"
TinySummary="Bonus Reaction Fire Damage"
LootTooltip="This weapon upgrade, when installed, increases a soldier's damage on Reaction Fire by <Ability:BONUSREACTIONFIREDAMAGESUP/>."

[HairTrigger_Sup X2AbilityTemplate]
LocFriendlyName="Basic Hair Trigger"
LocLongDescription="Reaction Fire deals +<Ability:BONUSREACTIONFIREDAMAGESUP/> damage."
LocHelpText="This weapon upgrade will increase a soldier's damage on Reaction Fire by <Ability:BONUSREACTIONFIREDAMAGESUP/>."

[ReloadUpgrade_Prt X2WeaponUpgradeTemplate]
FriendlyName="Prototype Auto-Loader"
FriendlyNamePlural="Prototype Auto-Loaders"
BriefSummary="Reloads do not cost an action."
TinySummary="Free Reloads"
LootTooltip="This weapon upgrade will grant unlimited free reloads to any weapon it is attached to."

[MissDamageUpgrade_Prt X2WeaponUpgradeTemplate]
FriendlyName="Prototype Stock"
FriendlyNamePlural="Prototype Stocks"
BriefSummary="Steady the weapon to get <font color='#3ABD23'>+<Ability:ABIZI_STEADY_M4/></font> aim on your next shot."
TinySummary="Maximum steady weapon"
LootTooltip="Allows to steady the weapon to get <font color='#3ABD23'>+<Ability:ABIZI_STEADY_M4/></font> aim on your next shot.

[FreeKillUpgrade_Prt X2WeaponUpgradeTemplate]
FriendlyName="Prototype Suppressor"
FriendlyNamePlural="Prototype Repeaters"
BriefSummary="There is a chance shooting with a suppressed weapon won't break concealment. The chance is reduced by 25%."
TinySummary="Retain concealment chance"
LootTooltip="This weapon upgrade, when installed, gives a chance to retain concealment. The chance is reduced by 25%."

[AbiziSteadyWeaponM4 X2AbilityTemplate]
LocFriendlyName="Steady Weapon"
LocLongDescription="Gain <font color='#3ABD23'>+<Ability:ABIZI_STEADY_M4/></font> aim on your next shot with your primary weapon. Bonus is lost if you use actions or are wounded."
LocHelpText="Gain <font color='#3ABD23'>+<Ability:ABIZI_STEADY_M4/></font> aim on your next shot with your primary weapon. Bonus is lost if you use actions or are wounded."
LocFlyOverText="Steady Weapon"

[SNHeavyBarrel_Prt X2WeaponUpgradeTemplate]
FriendlyName="Prototype Heavy Barrel"
FriendlyNamePlural="Prototype Heavy Barrels"
BriefSummary="Increases critical hit damage bonus by <Ability:SNHEAVYBARRELT4DMG/>."
TinySummary="Increased Critical Hit Damage"
LootTooltip="This weapon upgrade, when installed, adds a significant bonus to damage dealt on critical hits."

[RetrofitSNHeavyBarrel_BscToAdv X2TechTemplate]
DisplayName="Retrofit Basic Heavy Barrel"
Summary="Based on our newly developped magnetic weapons design, it should be possible to improve our stock of basic weapon upgrades."

[RetrofitSNHeavyBarrel_BscToSup X2TechTemplate]
DisplayName="Retrofit Basic Heavy Barrel"
Summary="Enhancing our existing weapon upgrades with Elerium-based technologies should greatly increase their stability and performance."

[RetrofitReloadUpgrade_AdvToSup X2TechTemplate]
DisplayName="Retrofit Advanced Heavy Barrel"
Summary="Enhancing our existing weapon upgrades with Elerium-based technologies should greatly increase their stability and performance."

[RetrofitMZWidthNozzle_BscToAdv X2TechTemplate]
DisplayName="Retrofit Basic Width Nozzel"
Summary="Based on our newly developped magnetic weapons design, it should be possible to improve our stock of basic weapon upgrades."

[RetrofitMZWidthNozzle_BscToSup X2TechTemplate]
DisplayName="Retrofit Basic Width Nozzle"
Summary="Enhancing our existing weapon upgrades with Elerium-based technologies should greatly increase their stability and performance."

[RetrofitMZWidthNozzle_AdvToSup X2TechTemplate]
DisplayName="Retrofit Advanced Width Nozel"
Summary="Enhancing our existing weapon upgrades with Elerium-based technologies should greatly increase their stability and performance."

[RetrofitMZLengthNozzle_BscToAdv X2TechTemplate]
DisplayName="Retrofit Basic Length Nozzel"
Summary="Based on our newly developped magnetic weapons design, it should be possible to improve our stock of basic weapon upgrades."

[RetrofitMZLengthNozzle_BscToSup X2TechTemplate]
DisplayName="Retrofit Basic Length Nozzle"
Summary="Enhancing our existing weapon upgrades with Elerium-based technologies should greatly increase their stability and performance."

[RetrofitMZLengthNozzle_AdvToSup X2TechTemplate]
DisplayName="Retrofit Advanced Length Nozel"
Summary="Enhancing our existing weapon upgrades with Elerium-based technologies should greatly increase their stability and performance."

[RetrofitMZClipSizeFuel_BscToAdv X2TechTemplate]
DisplayName="Retrofit Basic Expanded Fuel Tank"
Summary="Based on our newly developped magnetic weapons design, it should be possible to improve our stock of basic weapon upgrades."

[RetrofitMZClipSizeFuel_BscToSup X2TechTemplate]
DisplayName="Retrofit Basic Expanded Fuel Tank"
Summary="Enhancing our existing weapon upgrades with Elerium-based technologies should greatly increase their stability and performance."

[RetrofitMZClipSizeFuel_AdvToSup X2TechTemplate]
DisplayName="Retrofit Advanced Expanded Fuel Tank"
Summary="Enhancing our existing weapon upgrades with Elerium-based technologies should greatly increase their stability and performance."

[RetrofitFrame_BscToAdv X2TechTemplate]
DisplayName="Retrofit Basic Blade Frame"
Summary="Based on our newly developped magnetic weapons design, it should be possible to improve our stock of basic weapon upgrades."

[RetrofitFrame_BscToSup X2TechTemplate]
DisplayName="Retrofit Basic Blade Frame"
Summary="Enhancing our existing weapon upgrades with Elerium-based technologies should greatly increase their stability and performance."

[RetrofitFrame_AdvToSup X2TechTemplate]
DisplayName="Retrofit Advanced Blade Frame"
Summary="Enhancing our existing weapon upgrades with Elerium-based technologies should greatly increase their stability and performance."

[RetrofitSheath_BscToAdv X2TechTemplate]
DisplayName="Retrofit Basic Scrambler"
Summary="Based on our newly developped magnetic weapons design, it should be possible to improve our stock of basic weapon upgrades."

[RetrofitSheath_BscToSup X2TechTemplate]
DisplayName="Retrofit Basic Scrambler"
Summary="Enhancing our existing weapon upgrades with Elerium-based technologies should greatly increase their stability and performance."

[RetrofitSheath_AdvToSup X2TechTemplate]
DisplayName="Retrofit Advanced Scrambler"
Summary="Enhancing our existing weapon upgrades with Elerium-based technologies should greatly increase their stability and performance."

[RetrofitRapier_BscToAdv X2TechTemplate]
DisplayName="Retrofit Basic Targeting Module"
Summary="Based on our newly developped magnetic weapons design, it should be possible to improve our stock of basic weapon upgrades."

[RetrofitRapier_BscToSup X2TechTemplate]
DisplayName="Retrofit Basic Targeting Module"
Summary="Enhancing our existing weapon upgrades with Elerium-based technologies should greatly increase their stability and performance."

[RetrofitRapier_AdvToSup X2TechTemplate]
DisplayName="Retrofit Advanced Targeting Module"
Summary="Enhancing our existing weapon upgrades with Elerium-based technologies should greatly increase their stability and performance."

[RetrofitPommel_BscToAdv X2TechTemplate]
DisplayName="Retrofit Basic Pommel Micro Motor"
Summary="Based on our newly developped magnetic weapons design, it should be possible to improve our stock of basic weapon upgrades."

[RetrofitPommel_BscToSup X2TechTemplate]
DisplayName="Retrofit Basic Pommel Micro Motor"
Summary="Enhancing our existing weapon upgrades with Elerium-based technologies should greatly increase their stability and performance."

[RetrofitPommel_AdvToSup X2TechTemplate]
DisplayName="Retrofit Advanced Pommel Micro Motor"
Summary="Enhancing our existing weapon upgrades with Elerium-based technologies should greatly increase their stability and performance."

[RetrofitXGuard_BscToAdv X2TechTemplate]
DisplayName="Retrofit Basic Crossguard Taptic Module"
Summary="Based on our newly developped magnetic weapons design, it should be possible to improve our stock of basic weapon upgrades."

[RetrofitXGuard_BscToSup X2TechTemplate]
DisplayName="Retrofit Basic Crossguard Taptic Module"
Summary="Enhancing our existing weapon upgrades with Elerium-based technologies should greatly increase their stability and performance."

[RetrofitXGuard_AdvToSup X2TechTemplate]
DisplayName="Retrofit Advanced Crossguard Taptic Module"
Summary="Enhancing our existing weapon upgrades with Elerium-based technologies should greatly increase their stability and performance."

[RetrofitCoating_BscToAdv X2TechTemplate]
DisplayName="Retrofit Basic Pressurized Dispenser"
Summary="Based on our newly developped magnetic weapons design, it should be possible to improve our stock of basic weapon upgrades."

[RetrofitCoating_BscToSup X2TechTemplate]
DisplayName="Retrofit Basic Pressurized Dispenser"
Summary="Enhancing our existing weapon upgrades with Elerium-based technologies should greatly increase their stability and performance."

[RetrofitCoating_AdvToSup X2TechTemplate]
DisplayName="Retrofit Advanced Pressurized Dispenser"
Summary="Enhancing our existing weapon upgrades with Elerium-based technologies should greatly increase their stability and performance."

[RetrofitReflector_BscToAdv X2TechTemplate]
DisplayName="Retrofit Basic Feedback Capacitor"
Summary="Based on our newly developped magnetic weapons design, it should be possible to improve our stock of basic weapon upgrades."

[RetrofitReflector_BscToSup X2TechTemplate]
DisplayName="Retrofit Basic Feedback Capacitor"
Summary="Enhancing our existing weapon upgrades with Elerium-based technologies should greatly increase their stability and performance."

[RetrofitReflector_AdvToSup X2TechTemplate]
DisplayName="Retrofit Advanced Feedback Capacitor"
Summary="Enhancing our existing weapon upgrades with Elerium-based technologies should greatly increase their stability and performance."

[RetrofitHilt_BscToAdv X2TechTemplate]
DisplayName="Retrofit Basic Network Tracker"
Summary="Based on our newly developped magnetic weapons design, it should be possible to improve our stock of basic weapon upgrades."

[RetrofitHilt_BscToSup X2TechTemplate]
DisplayName="Retrofit Basic Network Tracker"
Summary="Enhancing our existing weapon upgrades with Elerium-based technologies should greatly increase their stability and performance."

[RetrofitHilt_AdvToSup X2TechTemplate]
DisplayName="Retrofit Advanced Network Tracker"
Summary="Enhancing our existing weapon upgrades with Elerium-based technologies should greatly increase their stability and performance."

[RetrofitDraktenAlloy_BscToAdv X2TechTemplate]
DisplayName="Retrofit Basic Alloy"
Summary="Based on our newly developped magnetic weapons design, it should be possible to improve our stock of basic weapon upgrades."

[RetrofitDraktenAlloy_BscToSup X2TechTemplate]
DisplayName="Retrofit Basic Alloy"
Summary="Enhancing our existing weapon upgrades with Elerium-based technologies should greatly increase their stability and performance."

[RetrofitDraktenAlloy_AdvToSup X2TechTemplate]
DisplayName="Retrofit Advanced Alloy"
Summary="Enhancing our existing weapon upgrades with Elerium-based technologies should greatly increase their stability and performance."

[RetrofitDraktenBullseye_BscToAdv X2TechTemplate]
DisplayName="Retrofit Basic Bullseye Module"
Summary="Based on our newly developped magnetic weapons design, it should be possible to improve our stock of basic weapon upgrades."

[RetrofitDraktenBullseye_BscToSup X2TechTemplate]
DisplayName="Retrofit Basic Bullseye Module"
Summary="Enhancing our existing weapon upgrades with Elerium-based technologies should greatly increase their stability and performance."

[RetrofitDraktenBullseye_AdvToSup X2TechTemplate]
DisplayName="Retrofit Advanced Bullseye Module"
Summary="Enhancing our existing weapon upgrades with Elerium-based technologies should greatly increase their stability and performance."

[RetrofitDraktenBigboom_BscToAdv X2TechTemplate]
DisplayName="Retrofit Basic Breaching Module"
Summary="Based on our newly developped magnetic weapons design, it should be possible to improve our stock of basic weapon upgrades."

[RetrofitDraktenBigboom_BscToSup X2TechTemplate]
DisplayName="Retrofit Basic Breaching Module"
Summary="Enhancing our existing weapon upgrades with Elerium-based technologies should greatly increase their stability and performance."

[RetrofitDraktenBigboom_AdvToSup X2TechTemplate]
DisplayName="Retrofit Advanced Breaching Module"
Summary="Enhancing our existing weapon upgrades with Elerium-based technologies should greatly increase their stability and performance."

[RetrofitDraktenFold_BscToAdv X2TechTemplate]
DisplayName="Retrofit Basic Fold Module"
Summary="Based on our newly developped magnetic weapons design, it should be possible to improve our stock of basic weapon upgrades."

[RetrofitDraktenFold_BscToSup X2TechTemplate]
DisplayName="Retrofit Basic Fold Module"
Summary="Enhancing our existing weapon upgrades with Elerium-based technologies should greatly increase their stability and performance."

[RetrofitDraktenFold_AdvToSup X2TechTemplate]
DisplayName="Retrofit Advanced Fold Module"
Summary="Enhancing our existing weapon upgrades with Elerium-based technologies should greatly increase their stability and performance."

[RetrofitDraktenKnock_BscToAdv X2TechTemplate]
DisplayName="Retrofit Basic KnockRush System"
Summary="Based on our newly developped magnetic weapons design, it should be possible to improve our stock of basic weapon upgrades."

[RetrofitDraktenKnock_BscToSup X2TechTemplate]
DisplayName="Retrofit Basic KnockRush System"
Summary="Enhancing our existing weapon upgrades with Elerium-based technologies should greatly increase their stability and performance."

[RetrofitDraktenKnock_AdvToSup X2TechTemplate]
DisplayName="Retrofit Advanced KnockRush System"
Summary="Enhancing our existing weapon upgrades with Elerium-based technologies should greatly increase their stability and performance."

[RetrofitDraktenSiphon_BscToAdv X2TechTemplate]
DisplayName="Retrofit Basic Siphon Matrix"
Summary="Based on our newly developped magnetic weapons design, it should be possible to improve our stock of basic weapon upgrades."

[RetrofitDraktenSiphon_BscToSup X2TechTemplate]
DisplayName="Retrofit Basic Siphon Matrix"
Summary="Enhancing our existing weapon upgrades with Elerium-based technologies should greatly increase their stability and performance."

[RetrofitDraktenSiphon_AdvToSup X2TechTemplate]
DisplayName="Retrofit Advanced Siphon Matrix"
Summary="Enhancing our existing weapon upgrades with Elerium-based technologies should greatly increase their stability and performance."



